Revit 2027 API
MassLevelData.ConceptualConstructionIsByEnergyData Property
 Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized with the EnergyDataSettings or if it overrides those settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ConceptualConstructionIsByEnergyData { get; set; }
Public Property ConceptualConstructionIsByEnergyData As Boolean
	Get
	Set
public:
property bool ConceptualConstructionIsByEnergyData {
	bool get ();
	void set (bool value);
}
member ConceptualConstructionIsByEnergyData : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData.
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace